memory-barrier.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-12-23 Sat 09:42 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Memory Barrier/内存屏障</title>
<meta name="generator" content="Org mode" />
<link rel="shortcut icon" href="http://ycode.org/css/favicon.ico" />
      <link rel="stylesheet" type="text/css" href="css/site.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://ycode.org"> HOME </a>
</div><div id="content">
<h1 class="title">Memory Barrier/内存屏障</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd754ffa">1. 问题定义</a></li>
<li><a href="#orga95edde">2. 相关资料</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgd754ffa" class="outline-2">
<h2 id="orgd754ffa"><span class="section-number-2">1</span> 问题定义</h2>
<div class="outline-text-2" id="text-1">
<p>
内存屏障, 又称内存栅栏, 是一种内存访问操作中的同步指令, 其功能是保证此指令之前的
所有内存读写操作都执行后, 此指令之后的读写操作才会发起. 
</p>

<p>
Intel CPU有mfence, lfence, sfence
</p>
<ul class="org-ul">
<li>sfence</li>
</ul>
<blockquote>
<p>
The SFENCE (Store Fence) instruction controls write ordering by creating a fence
for memory store operations. This instruction guarantees that the result of
every store instruction that precedes the store fence in program order is
globally visible before any store instruction that follows the fence. The SFENCE
instruction provides an efficient way of ensuring ordering between procedures
that produce weakly-ordered data and procedures that consume that data.
</p>
</blockquote>
<dl class="org-dl">
<dt>mfence</dt><dd></dd>

<dt>lfence</dt><dd></dd>
</dl>
</div>
</div>

<div id="outline-container-orga95edde" class="outline-2">
<h2 id="orga95edde"><span class="section-number-2">2</span> 相关资料</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="http://www.intel.com/content/www/us/en/processors/architectures-software-developer-manuals.html">Intel Processors Architecture Software Developer Manuals</a></li>
<li><a href="http://blog.csdn.net/qb_2008/article/details/6840593">linux内核中的内存屏障</a></li>
<li><a href="http://www.wowotech.net/kernel_synchronization/Why-Memory-Barriers.html">Why Memory Barriers? 中文翻译(上)</a></li>
<li></li>
</ul>
</div>
</div>
</div>
</body>
</html>
